app/views/books/show.html.erb

<h2>Reviews</h2>
<% @book.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = 2