app/controllers/books_controller.rb

  def index
    @genres = Genre.all
    @books = Book.includes(:author, :genre)

    if params[:genre].present?
      @books = @books.where(genre_id: params[:genre])
    end

    if params[:search].present?
      @books = @books.where("title LIKE ?", "%#{params[:search]}%")
    end

    @books = @books.page(params[:page]).per(6)
---
SELECT "genres".* FROM "genres"
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (3, 6, 2, 9, 4)
SELECT "books".* FROM "books" WHERE (title LIKE '%bhb%')
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN (5, 2, 3, 1)
SELECT "authors".* FROM "authors" WHERE "authors"."id" = 3 LIMIT 1
SELECT "genres".* FROM "genres" WHERE "genres"."id" = 5 LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."id" = 2 LIMIT 1
SELECT "books".* FROM "books" WHERE "books"."genre_id" = 2 AND (title LIKE '%Lilies of the Field%') LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM "books" WHERE "books"."genre_id" = 5 AND (title LIKE '%hbbb%')